_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_31 (Conv1D)           (None, 384004, 3)         75        
_________________________________________________________________
batch_normalization_16 (Batc (None, 384004, 3)         12        
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 128002, 3)         219       
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 64001, 3)          0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 21334, 6)          438       
_________________________________________________________________
batch_normalization_17 (Batc (None, 21334, 6)          24        
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 7112, 6)           870       
_________________________________________________________________
max_pooling1d_17 (MaxPooling (None, 3556, 6)           0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 1186, 9)           1305      
_________________________________________________________________
batch_normalization_18 (Batc (None, 1186, 9)           36        
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 396, 9)            1953      
_________________________________________________________________
max_pooling1d_18 (MaxPooling (None, 198, 9)            0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 66, 12)            2604      
_________________________________________________________________
batch_normalization_19 (Batc (None, 66, 12)            48        
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 22, 12)            3468      
_________________________________________________________________
max_pooling1d_19 (MaxPooling (None, 11, 12)            0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 4, 15)             4335      
_________________________________________________________________
batch_normalization_20 (Batc (None, 4, 15)             60        
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 2, 15)             5415      
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 1, 15)             0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 15)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 12)                192       
_________________________________________________________________
dense_11 (Dense)             (None, 12)                156       
_________________________________________________________________
dropout_4 (Dropout)          (None, 12)                0         
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 26        
=================================================================
Total params: 21,236
Trainable params: 21,146
Non-trainable params: 90
_________________________________________________________________
