_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_25 (Conv1D)           (None, 288003, 3)         75        
_________________________________________________________________
batch_normalization_13 (Batc (None, 288003, 3)         12        
_________________________________________________________________
conv1d_26 (Conv1D)           (None, 72001, 3)          219       
_________________________________________________________________
max_pooling1d_13 (MaxPooling (None, 36000, 3)          0         
_________________________________________________________________
conv1d_27 (Conv1D)           (None, 9000, 6)           438       
_________________________________________________________________
batch_normalization_14 (Batc (None, 9000, 6)           24        
_________________________________________________________________
conv1d_28 (Conv1D)           (None, 2250, 6)           870       
_________________________________________________________________
max_pooling1d_14 (MaxPooling (None, 1125, 6)           0         
_________________________________________________________________
conv1d_29 (Conv1D)           (None, 282, 9)            1305      
_________________________________________________________________
batch_normalization_15 (Batc (None, 282, 9)            36        
_________________________________________________________________
conv1d_30 (Conv1D)           (None, 71, 9)             1953      
_________________________________________________________________
max_pooling1d_15 (MaxPooling (None, 35, 9)             0         
_________________________________________________________________
conv1d_31 (Conv1D)           (None, 9, 12)             2604      
_________________________________________________________________
batch_normalization_16 (Batc (None, 9, 12)             48        
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 3, 12)             3468      
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 1, 12)             0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 12)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 12)                156       
_________________________________________________________________
dense_11 (Dense)             (None, 12)                156       
_________________________________________________________________
dropout_4 (Dropout)          (None, 12)                0         
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 26        
=================================================================
Total params: 11,390
Trainable params: 11,330
Non-trainable params: 60
_________________________________________________________________
