_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_31 (Conv1D)           (None, 1152012, 3)        78        
_________________________________________________________________
batch_normalization_16 (Batc (None, 1152012, 3)        12        
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 1152012, 3)        228       
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 576006, 3)         0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 576006, 6)         456       
_________________________________________________________________
batch_normalization_17 (Batc (None, 576006, 6)         24        
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 576006, 6)         906       
_________________________________________________________________
max_pooling1d_17 (MaxPooling (None, 288003, 6)         0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 288003, 9)         1359      
_________________________________________________________________
batch_normalization_18 (Batc (None, 288003, 9)         36        
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 288003, 9)         2034      
_________________________________________________________________
max_pooling1d_18 (MaxPooling (None, 144001, 9)         0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 144001, 12)        2712      
_________________________________________________________________
batch_normalization_19 (Batc (None, 144001, 12)        48        
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 144001, 12)        3612      
_________________________________________________________________
max_pooling1d_19 (MaxPooling (None, 72000, 12)         0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 72000, 15)         4515      
_________________________________________________________________
batch_normalization_20 (Batc (None, 72000, 15)         60        
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 72000, 15)         5640      
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 36000, 15)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 540000)            0         
_________________________________________________________________
dense_10 (Dense)             (None, 12)                6480012   
_________________________________________________________________
dense_11 (Dense)             (None, 12)                156       
_________________________________________________________________
dropout_4 (Dropout)          (None, 12)                0         
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 26        
=================================================================
Total params: 6,501,914
Trainable params: 6,501,824
Non-trainable params: 90
_________________________________________________________________
