Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 1152012, 3)        78        
_________________________________________________________________
batch_normalization_1 (Batch (None, 1152012, 3)        12        
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 1152012, 3)        228       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 576006, 3)         0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 576006, 6)         456       
_________________________________________________________________
batch_normalization_2 (Batch (None, 576006, 6)         24        
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 576006, 6)         906       
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 288003, 6)         0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 288003, 9)         1359      
_________________________________________________________________
batch_normalization_3 (Batch (None, 288003, 9)         36        
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 288003, 9)         2034      
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 144001, 9)         0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 144001, 12)        2712      
_________________________________________________________________
batch_normalization_4 (Batch (None, 144001, 12)        48        
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 144001, 12)        3612      
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 72000, 12)         0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 72000, 15)         4515      
_________________________________________________________________
batch_normalization_5 (Batch (None, 72000, 15)         60        
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 72000, 15)         5640      
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 36000, 15)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 540000)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 12)                6480012   
_________________________________________________________________
dense_2 (Dense)              (None, 12)                156       
_________________________________________________________________
dropout_1 (Dropout)          (None, 12)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 26        
=================================================================
Total params: 6,501,914
Trainable params: 6,501,824
Non-trainable params: 90
_________________________________________________________________
