_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_31 (Conv1D)           (None, 576006, 3)         1503      
_________________________________________________________________
batch_normalization_16 (Batc (None, 576006, 3)         12        
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 576006, 3)         4503      
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 288003, 3)         0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 144002, 6)         9006      
_________________________________________________________________
batch_normalization_17 (Batc (None, 144002, 6)         24        
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 144002, 6)         18006     
_________________________________________________________________
max_pooling1d_17 (MaxPooling (None, 72001, 6)          0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 36001, 9)          27009     
_________________________________________________________________
batch_normalization_18 (Batc (None, 36001, 9)          36        
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 36001, 9)          40509     
_________________________________________________________________
max_pooling1d_18 (MaxPooling (None, 18000, 9)          0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 9000, 12)          54012     
_________________________________________________________________
batch_normalization_19 (Batc (None, 9000, 12)          48        
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 9000, 12)          72012     
_________________________________________________________________
max_pooling1d_19 (MaxPooling (None, 4500, 12)          0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 2250, 15)          90015     
_________________________________________________________________
batch_normalization_20 (Batc (None, 2250, 15)          60        
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 2250, 15)          112515    
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 1125, 15)          0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 16875)             0         
_________________________________________________________________
dense_10 (Dense)             (None, 64)                1080064   
_________________________________________________________________
dense_11 (Dense)             (None, 64)                4160      
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 130       
=================================================================
Total params: 1,513,624
Trainable params: 1,513,534
Non-trainable params: 90
_________________________________________________________________
