_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_31 (Conv1D)           (None, 576006, 3)         753       
_________________________________________________________________
batch_normalization_16 (Batc (None, 576006, 3)         12        
_________________________________________________________________
conv1d_32 (Conv1D)           (None, 576006, 3)         2253      
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 288003, 3)         0         
_________________________________________________________________
conv1d_33 (Conv1D)           (None, 144002, 6)         4506      
_________________________________________________________________
batch_normalization_17 (Batc (None, 144002, 6)         24        
_________________________________________________________________
conv1d_34 (Conv1D)           (None, 144002, 6)         9006      
_________________________________________________________________
max_pooling1d_17 (MaxPooling (None, 72001, 6)          0         
_________________________________________________________________
conv1d_35 (Conv1D)           (None, 36001, 9)          13509     
_________________________________________________________________
batch_normalization_18 (Batc (None, 36001, 9)          36        
_________________________________________________________________
conv1d_36 (Conv1D)           (None, 36001, 9)          20259     
_________________________________________________________________
max_pooling1d_18 (MaxPooling (None, 18000, 9)          0         
_________________________________________________________________
conv1d_37 (Conv1D)           (None, 9000, 12)          27012     
_________________________________________________________________
batch_normalization_19 (Batc (None, 9000, 12)          48        
_________________________________________________________________
conv1d_38 (Conv1D)           (None, 9000, 12)          36012     
_________________________________________________________________
max_pooling1d_19 (MaxPooling (None, 4500, 12)          0         
_________________________________________________________________
conv1d_39 (Conv1D)           (None, 2250, 15)          45015     
_________________________________________________________________
batch_normalization_20 (Batc (None, 2250, 15)          60        
_________________________________________________________________
conv1d_40 (Conv1D)           (None, 2250, 15)          56265     
_________________________________________________________________
max_pooling1d_20 (MaxPooling (None, 1125, 15)          0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 16875)             0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               2160128   
_________________________________________________________________
dense_11 (Dense)             (None, 128)               16512     
_________________________________________________________________
dropout_4 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 2)                 258       
=================================================================
Total params: 2,391,668
Trainable params: 2,391,578
Non-trainable params: 90
_________________________________________________________________
